zpyws/rt-thread-v4.0.2-cy8c6347-wristband/rtt_posc6347/kx022/kx022_defs.h
#define KX022_WAKEUP_THRES_LSB_MSK     UINT16_C(0x000F)

#define KX022_WAKEUP_THRES_MSB_MSK     UINT16_C(0x0FF0)
#define KX022_WAKEUP_THRES_MSB_POS     UINT8_C(4)

#define KX022_WAKEUP_TIMEOUT_THRES_MSK UINT8_C(0xF0)
#define KX022_WAKEUP_TIMEOUT_THRES_POS UINT8_C(4)

#define KX022_WAKEUP_INTERRUPT_MSK     UINT8_C(0x02)
#define KX022_WAKEUP_INTERRUPT_POS     UINT8_C(1)

#define KX022_AUTO_LOW_POW_MSK       UINT8_C(0x0F)

#define KX022_AUTO_LP_THRES_MSK      UINT16_C(0x0FF0)
#define KX022_AUTO_LP_THRES_POS      UINT8_C(4)

#define KX022_AUTO_LP_THRES_LSB_MSK  UINT16_C(0x000F)

#define KX022_WKUP_REF_UPDATE_MSK    UINT8_C(0x03)

#define KX022_AUTO_LP_TIMEOUT_LSB_MSK UINT8_C(0xF0)
#define KX022_AUTO_LP_TIMEOUT_LSB_POS UINT8_C(4)

#define KX022_SAMPLE_COUNT_MSK        UINT8_C(0x1C)
#define KX022_SAMPLE_COUNT_POS        UINT8_C(2)

#define KX022_WAKEUP_EN_AXES_MSK      UINT8_C(0xE0)
#define KX022_WAKEUP_EN_AXES_POS      UINT8_C(5)

#define KX022_TAP_AXES_EN_MSK         UINT8_C(0x18)
#define KX022_TAP_AXES_EN_POS         UINT8_C(3)

#define KX022_TAP_QUIET_DT_MSK         UINT8_C(0x30)
#define KX022_TAP_QUIET_DT_POS         UINT8_C(4)

#define KX022_TAP_QUIET_MSK            UINT8_C(0x0C)
#define KX022_TAP_QUIET_POS            UINT8_C(2)

#define KX022_TAP_TICS_TH_MSK         UINT8_C(0x03)

#define KX022_TAP_SENSITIVITY_MSK     UINT8_C(0X07)

#define KX022_ACT_CH_AXES_EN_MSK      UINT8_C(0xE0)
#define KX022_ACT_CH_AXES_EN_POS      UINT8_C(5)

#define KX022_ACT_CH_NPTS_MSK         UINT8_C(0x0F)

#define KX022_INT_AXES_EN_MSK    UINT8_C(0xE0)
#define KX022_INT_AXES_EN_POS    UINT8_C(5)

#define KX022_INT_REFU_MSK       UINT8_C(0x0C)
#define KX022_INT_REFU_POS       UINT8_C(2)

#define KX022_INT_HYST_MSK         UINT8_C(0x03)
#define KX022_STABILITY_MODE_MSK   UINT8_C(0x03)

#define KX022_GEN_INT_COMB_MSK      UINT8_C(0x01)

#define KX022_GEN_INT_CRITERION_MSK  UINT8_C(0x02)
#define KX022_GEN_INT_CRITERION_POS  UINT8_C(0x01)

#define KX022_INT_PIN1_CONF_MSK   UINT8_C(0x06)
#define KX022_INT_PIN1_CONF_POS   UINT8_C(1)

#define KX022_INT_PIN2_CONF_MSK   UINT8_C(0x60)
#define KX022_INT_PIN2_CONF_POS   UINT8_C(5)

#define KX022_INT_STATUS_MSK     UINT8_C(0xE0)
#define KX022_INT_STATUS_POS     UINT8_C(5)

#define KX022_EN_DRDY_MSK  UINT8_C(0x80)
#define KX022_EN_DRDY_POS  UINT8_C(7)

#define KX022_EN_FIFO_WM_MSK  UINT8_C(0x40)
#define KX022_EN_FIFO_WM_POS  UINT8_C(6)

#define KX022_EN_FIFO_FULL_MSK  UINT8_C(0x20)
#define KX022_EN_FIFO_FULL_POS  UINT8_C(5)

#define KX022_EN_INT_OVERRUN_MSK  UINT8_C(0x10)
#define KX022_EN_INT_OVERRUN_POS  UINT8_C(4)

#define KX022_EN_GEN2_MSK  UINT8_C(0x08)
#define KX022_EN_GEN2_POS  UINT8_C(3)

#define KX022_EN_GEN1_MSK  UINT8_C(0x04)
#define KX022_EN_GEN1_POS  UINT8_C(2)

#define KX022_EN_ORIENT_CH_MSK  UINT8_C(0x02)
#define KX022_EN_ORIENT_CH_POS  UINT8_C(1)

#define KX022_EN_LATCH_MSK  UINT8_C(0x80)
#define KX022_EN_LATCH_POS  UINT8_C(7)

#define KX022_EN_ACTCH_MSK  UINT8_C(0x10)
#define KX022_EN_ACTCH_POS  UINT8_C(4)

#define KX022_EN_D_TAP_MSK  UINT8_C(0x08)
#define KX022_EN_D_TAP_POS  UINT8_C(3)

#define KX022_EN_S_TAP_MSK  UINT8_C(0x04)
#define KX022_EN_S_TAP_POS  UINT8_C(2)

#define KX022_EN_STEP_INT_MSK  UINT8_C(0x01)

#define KX022_STEP_MAP_INT2_MSK  UINT8_C(0x10)
#define KX022_STEP_MAP_INT2_POS  UINT8_C(4)

#define KX022_EN_WAKEUP_INT_MSK  UINT8_C(0x01)

#define KX022_TAP_MAP_INT1_MSK  UINT8_C(0x04)
#define KX022_TAP_MAP_INT1_POS  UINT8_C(2)

#define KX022_TAP_MAP_INT2_MSK  UINT8_C(0x40)
#define KX022_TAP_MAP_INT2_POS  UINT8_C(6)

#define KX022_ACTCH_MAP_INT1_MSK  UINT8_C(0x08)
#define KX022_ACTCH_MAP_INT1_POS  UINT8_C(3)

#define KX022_ACTCH_MAP_INT2_MSK  UINT8_C(0x80)
#define KX022_ACTCH_MAP_INT2_POS  UINT8_C(7)

#define KX022_FIFO_BYTES_CNT_MSK  UINT8_C(0x07)

#define KX022_FIFO_TIME_EN_MSK  UINT8_C(0x04)
#define KX022_FIFO_TIME_EN_POS  UINT8_C(2)

#define KX022_FIFO_AXES_EN_MSK  UINT8_C(0xE0)
#define KX022_FIFO_AXES_EN_POS  UINT8_C(5)

#define KX022_FIFO_8_BIT_EN_MSK  UINT8_C(0x10)
#define KX022_FIFO_8_BIT_EN_POS  UINT8_C(4)
/**\name Macro to SET and GET BITS of a register */
#define KX022_SET_BITS(reg_data, bitname, data) \
	((reg_data & ~(bitname ## _MSK)) |	 \
	 ((data << bitname ## _POS) & bitname ## _MSK))

#define KX022_GET_BITS(reg_data, bitname)  ((reg_data & (bitname ## _MSK)) >> \
					     (bitname ## _POS))

#define KX022_SET_BITS_POS_0(reg_data, bitname, data) \
	((reg_data & ~(bitname ## _MSK)) |	       \
	 (data & bitname ## _MSK))

#define KX022_GET_BITS_POS_0(reg_data, bitname)  (reg_data & (bitname ## _MSK))

#define KX022_SET_BIT_VAL_0(reg_data, bitname) (reg_data & ~(bitname ## _MSK))

#define KX022_GET_LSB(var)     (uint8_t)(var & KX022_SET_LOW_BYTE)
#define KX022_GET_MSB(var)     (uint8_t)((var & KX022_SET_HIGH_BYTE) >> 8)
/********************************************************/
/*!
 * @brief Interface selection enums
 */
enum kx022_intf {
	/*! SPI interface */
	KX022_SPI_INTF,
	/*! I2C interface */
	KX022_I2C_INTF
};
/********************************************************/
/**\name	TYPE DEFINITIONS */
/*!
 * @brief Bus communication function pointer which should be mapped to
 * the platform specific read and write functions of the user
 */
typedef int8_t (*kx022_com_fptr_t)(void *intf_ptr, uint8_t dev_id, uint8_t reg_addr, uint8_t *reg_data,
				    uint16_t length);
/*!	Delay function pointer */
typedef void (*kx022_delay_fptr_t)(uint32_t period);
/********************************************************/
/**\name	STRUCTURE DEFINITIONS*/
/*!
 * @brief Sensor selection enums
 */
enum kx022_sensor {
	KX022_ACCEL,
	KX022_TAP_INT,
	KX022_ACTIVITY_CHANGE_INT,
	KX022_GEN1_INT,
	KX022_GEN2_INT,
	KX022_ORIENT_CHANGE_INT,
	KX022_STEP_COUNTER_INT
};

/*!
 * @brief Interrupt channel selection enums
 */
enum kx022_int_chan {
	KX022_UNMAP_INT_PIN,
	KX022_INT_CHANNEL_1,
	KX022_INT_CHANNEL_2,
	KX022_MAP_BOTH_INT_PINS
};
/*!
 * @brief Interrupt pin hardware configurations
 */
struct kx022_int_pin_conf {
	/*! Interrupt channel selection enums */
	enum kx022_int_chan int_chan;
	/*! Interrupt pin configuration
	 * Assignable Macros :
	 *  - KX022_INT_PUSH_PULL_ACTIVE_0
	 *  - KX022_INT_PUSH_PULL_ACTIVE_1
	 *  - KX022_INT_OPEN_DRIVE_ACTIVE_0
	 *  - KX022_INT_OPEN_DRIVE_ACTIVE_1
	 */
	uint8_t pin_conf;
};
/*!
 * @brief Accel basic configuration
 */
struct kx022_acc_conf {
	/*! Output data rate
	 * Assignable macros :
	 *                      - KX022_ODR_1_HZ   - KX022_ODR_1_95HZ
	 *  - KX022_ODR_3_9HZ   - KX022_ODR_7_81HZ  - KX022_ODR_15_63HZ
	 *  - KX022_ODR_31_25HZ - KX022_ODR_62_5HZ  - KX022_ODR_125HZ   
	 *  - KX022_ODR_250HZ   - KX022_ODR_500HZ   - KX022_ODR_1000HZ
	 */
	uint8_t odr;
	/*! Range of sensor
	 * Assignable macros :
	 *  - KX022_2G_RANGE   - KX022_8G_RANGE
	 *  - KX022_4G_RANGE   - KX022_16G_RANGE
	 */
	uint8_t range;

	/*! Filter 1 Bandwidth
	 * Assignable macros :
	 *  - KX022_ACCEL_FILT1_BW_0
	 *  - KX022_ACCEL_FILT1_BW_1
	 */
	uint8_t bw;
};
/*!
 * @brief Union of sensor Configurations
 */
union kx022_set_param {
	/* Accel configurations */
	struct kx022_acc_conf accel;
};
/*!
 * @brief Sensor selection and their configurations
 */
struct kx022_sensor_conf {
	/* Sensor selection */
	enum kx022_sensor type;
	/* Sensor configuration */
	union kx022_set_param param;
};
/*!
 * @brief enum to select device settings
 */
enum kx022_device {
	KX022_AUTOWAKEUP_TIMEOUT,
	KX022_AUTOWAKEUP_INT,
	KX022_AUTO_LOW_POWER,
	KX022_INT_PIN_CONF,
	KX022_INT_OVERRUN_CONF,
	KX022_FIFO_CONF
};

/*!
 * @brief KX022 auto-wakeup configurations
 */
struct kx022_auto_wakeup_conf {
	/*! Enable auto wake-up by using timeout threshold
	 * Assignable Macros :
	 *   - KX022_ENABLE    - KX022_DISABLE
	 */
	uint8_t wakeup_timeout;
	/*! Timeout threshold after which auto wake-up occurs
	 * It is 12bit value configurable at 2.5ms/LSB
	 * Maximum timeout is 10.24s (4096 * 2.5) for
	 * which the assignable macro is :
	 *      - KX022_AUTO_WAKEUP_TIMEOUT_MAX
	 */
	uint16_t timeout_thres;
};
/*!
 * @brief KX022 wakeup configurations
 */
struct kx022_wakeup_conf {
	/*! Wakeup reference update
	 *  Assignable macros:
	 *   - KX022_MANUAL_UPDATE
	 *   - KX022_ONE_TIME_UPDATE
	 *   - KX022_EVERY_TIME_UPDATE
	 */
	uint8_t wakeup_ref_update;
	/*! Number of samples for interrupt condition evaluation
	 * Assignable Macros :
	 *  - KX022_SAMPLE_COUNT_1  - KX022_SAMPLE_COUNT_5
	 *  - KX022_SAMPLE_COUNT_2  - KX022_SAMPLE_COUNT_6
	 *  - KX022_SAMPLE_COUNT_3  - KX022_SAMPLE_COUNT_7
	 *  - KX022_SAMPLE_COUNT_4  - KX022_SAMPLE_COUNT_8
	 */
	uint8_t sample_count;
	/*! Enable low power wake-up interrupt for X(BIT 0), Y(BIT 1), Z(BIT 2)
	 * axes  0 - not active; 1 - active
	 * Assignable macros :
	 *  - KX022_X_AXIS_EN
	 *  - KX022_Y_AXIS_EN
	 *  - KX022_Z_AXIS_EN
	 *  - KX022_XYZ_AXIS_EN
	 */
	uint8_t wakeup_axes_en;
	/*! Interrupt threshold configuration  */
	uint8_t int_wkup_threshold;
	/*! Reference acceleration x-axis for the wake-up interrupt */
	uint8_t int_wkup_ref_x;
	/*! Reference acceleration y-axis for the wake-up interrupt */
	uint8_t int_wkup_ref_y;
	/*! Reference acceleration z-axis for the wake-up interrupt */
	uint8_t int_wkup_ref_z;
	/*! Interrupt channel to be mapped */
	enum kx022_int_chan int_chan;
};
/*!
 * @brief KX022 auto-low power configurations
 */
struct kx022_auto_lp_conf {
	/*! Enable auto low power mode using  data ready interrupt /
	 * Genric interrupt1 / timeout counter value
	 * Assignable macros :
	 * - KX022_AUTO_LP_DRDY_TRIGGER
	 * - KX022_AUTO_LP_GEN1_TRIGGER
	 * - KX022_AUTO_LP_TIMEOUT_EN
	 * - KX022_AUTO_LP_TIME_RESET_EN
	 * - KX022_AUTO_LP_TIMEOUT_DISABLE
	 */
	uint8_t auto_low_power_trigger;
	/*! Timeout threshold after which auto wake-up occurs
	 * It is 12bit value configurable at 2.5ms/LSB
	 * Maximum timeout is 10.24s (4096 * 2.5) for
	 *  which the assignable macro is :
	 *  - KX022_AUTO_LP_TIMEOUT_MAX
	 */
	uint16_t auto_lp_timeout_threshold;
};

/*!
 * @brief Interrupt overrun configurations
 */
struct kx022_int_overrun {
	/*! Interrupt pin mapping for interrupt overrun */
	enum kx022_int_chan int_chan;
};
/*!
 * @brief Union of device configuration parameters
 */
union kx022_device_params {
	/* Auto wakeup configurations */
	struct kx022_auto_wakeup_conf auto_wakeup;
	/* Wakeup interrupt configurations */
	struct kx022_wakeup_conf wakeup;
	/* Auto Low power configurations */
	struct kx022_auto_lp_conf auto_lp;
	/* Interrupt pin configurations */
	struct kx022_int_pin_conf int_conf;
	/* Interrupt overrun configuration */
	struct kx022_int_overrun overrun_int;
};
/*!
 * @brief KX022 device configuration
 */
struct kx022_device_conf {
	/* Device feature selection */
	enum kx022_device type;
	/* Device feature configuration */
	union kx022_device_params param;
};
/*!
 * @brief KX022 sensor data
 */
struct kx022_sensor_data {
	/*! X-axis sensor data */
	int16_t x;
	/*! Y-axis sensor data */
	int16_t y;
	/*! Z-axis sensor data */
	int16_t z;
	/*! sensor time */
	uint32_t sensortime;
};
/*!
 * @brief KX022 interrupt selection
 */
enum kx022_int_type {
	/* DRDY interrupt */
	KX022_DRDY_INT_EN,
	/* Generic interrupt 2 */
	KX022_GEN2_INT_EN,
	/* Generic interrupt 1 */
	KX022_GEN1_INT_EN,
	/* Orient change interrupt */
	KX022_ORIENT_CHANGE_INT_EN,
	/* Latch interrupt */
	KX022_LATCH_INT_EN,
	/* Activity change interrupt */
	KX022_ACTIVITY_CHANGE_INT_EN,
	/* Double tap interrupt */
	KX022_DOUBLE_TAP_INT_EN,
	/* Single tap interrupt */
	KX022_SINGLE_TAP_INT_EN,
	/* Step interrupt */
	KX022_STEP_COUNTER_INT_EN,
	/* Auto wakeup interrupt */
	KX022_AUTO_WAKEUP_EN
};
/*!
 * @brief Interrupt enable/disable configurations
 */
struct kx022_int_enable {
	/*! Enum to choose the interrupt to be enabled */
	enum kx022_int_type type;
	/*! Enable/ disable selected interrupts
	 * Assignable Macros :
	 *   - KX022_ENABLE
	 *   - KX022_DISABLE
	 */
	uint8_t conf;
};

/*!
 * @brief kx022 device structure
 */
struct kx022_dev {
	/*! Chip Id */
	uint8_t chip_id;
	/*! Device Id */
	uint8_t dev_id;
	/*! SPI/I2C Interface selection */
	enum kx022_intf intf;
	/*! Interface handle pointer */
	void *intf_ptr;
	/*! Decide SPI or I2C read mechanism */
	uint8_t dummy_byte;
	/*! Bus read function pointer */
	kx022_com_fptr_t read;
	/*! Bus write function pointer */
	kx022_com_fptr_t write;
	/*! delay(in ms) function pointer */
	kx022_delay_fptr_t delay_ms;
};

#endif /* KX022_DEFS_H_ */
/** @}*/
/** @}*/
